<a href="https://colab.research.google.com/github/AlinaGordymova/sql_lessons_homeworks/blob/main/Homework_lesson_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#установка библиотек
# !pip install psycopg2
# !pip install plotly

In [ ]:
import sqlite3
conn_sqlite = sqlite3.connect('TestDB.db')

In [ ]:
#проверка подключения PostgreSQL 
import psycopg2
import pandas as pd
#Библиотека ждя визуализации
from IPython.display import HTML
import plotly.express as px


#!введите свои реквизиты!
DB_HOST = '52.157.159.24'
DB_USER = 'student3'
DB_USER_PASSWORD = 'student3_password'
DB_NAME = 'sql_ex_third_stream'

conn_psql = psycopg2.connect(host=DB_HOST, user=DB_USER, password=DB_USER_PASSWORD, dbname=DB_NAME)

In [ ]:
# task1  (lesson6, дополнительно)
# SQL: Создайте таблицу с синтетическими данными (10000 строк, 3 колонки, все типы int) и заполните ее случайными данными от 0 до 1 000 000. 
# Проведите EXPLAIN операции и сравните базовые операции.

In [ ]:
df = pd.read_sql('''
with recursive generate_series(r1,r2,r3) as (
    select abs(random() % 1000000) as r1, abs(random() % 1000000) as r2, abs(random() % 1000000) as r3
    union all select abs(random() % 1000000) as r1, abs(random() % 1000000) as r2, abs(random() % 1000000) as r3
    from generate_series
    limit 10000)
 select * from generate_series;
''', conn_sqlite)

In [ ]:
df

          r1      r2      r3
0     774472  775123   52809
1     547236  528809  372954
2     211171  463583  878903
3     993132  546110  573780
4     102624   74223  902911
...      ...     ...     ...
9995  253772  393294  756923
9996  147313  909758  443546
9997  155037  831207  517234
9998  673977  596549  146394
9999  147843   23699  724154

[10000 rows x 3 columns]

In [ ]:
%%time
pd.read_sql('''
with recursive generate_series(r1,r2,r3) as (
    select abs(random() % 1000000) as r1, abs(random() % 1000000) as r2, abs(random() % 1000000) as r3
    union all select abs(random() % 1000000) as r1, abs(random() % 1000000) as r2, abs(random() % 1000000) as r3
    from generate_series
    limit 10000)
 select * from generate_series;
''', conn_sqlite)

CPU times: user 31.5 ms, sys: 1.38 ms, total: 32.9 ms
Wall time: 36.3 ms

          r1      r2      r3
0     967986  746382   97611
1     311088  903282  565812
2     116491  920012  133140
3     332678  820515   89184
4      30464  144816  907873
...      ...     ...     ...
9995  898265  247299  218516
9996  885075  668466  344804
9997  758176  768857  589208
9998  748902  389999  856841
9999  902344  790208  322742

[10000 rows x 3 columns]